from typing import Counter
from wordcloud import WordCloud

words = ['肉', '何', '点', '盛り', '様', '肉', 'お願い', 'する', '事', '♬', '私', '達', '好み', 'こちら', '何', '記念', '日', '臨時', '収入', 'あっ', '時', '笑', '邪魔', 'でき', '毎度', '大変', '満足', '満腹', '幸せ', '気分', 'し', 'もらっ', '外食', 'し', '時', '肉', '選択', 'ない', 'ん', '中', '無償', '肉', '食べ', 'なっ', '時', '決まっ', '羅', '炭火', '焼く', '肉', 'サイド', 'メニュー', '美味しい', '最初', 'レバ', '刺し', '食べ', '時', '(', 'ﾟ', 'д', 'ﾟ', ')！', '濃厚', 'ビックリ', '♪', 'サービス', 'サラダ', 'ドレッシング', '持っ', '帰り', '味', 'スープ', '苦手', 'ユッケジャンスープ', '野菜', 'たっぷり', '美味しい', '教え', 'もらっ', 'よかっ', '♪', 'コストパフォーマンス', '高め', '気', 'する', '店', '帰る', '時', '今日', '食べ', '〜', 'お腹', 'さすっ', '帰宅', 'する', '満足', 'し', '新大久保', 'いい', 'w', '帰り道', 'ずらし', '食べ', '行っ', '欲しい', '店', '肉', '食べ',
         'なっ', '焼肉', '店', 'さがし', '羅', '発見', '入っ', 'み', '入っ', 'みる', '韓国', '人', '店員', 'さん', 'ママ', 'さん', '笑顔', '出迎え', 'し', 'くれ', '生肉', '食べ', '〜', 'し', 'ない', '思い', '聞い', 'みる', 'あり', '〜」', 'こと', 'ユッケ', 'レバ', '刺し', '注文', '飲み物', 'なに', 'しよ', '悩ん', 'い', 'マッコリ', '見つけ', '注文', 'カルビ', '〜', 'ハラ', 'ミ', '〜', '豚', 'バラ', '〜', '肉', '注文', 'し', 'スープ', 'ユッケジャンスープ', 'お腹', 'いっぱい', '残し', 'しまっ', '味', '美味しかっ', '残っ', 'マッコリ', '持っ', '帰り', '行っ', '袋', '入れ', 'くれ', 'つまみ', '分け', 'くれ', 'ママ', '優しい', '感じ', '行こ', '思い']

count = Counter(words)
words_counted = count.most_common(40)


def make_cloud(potato):
    file_name = input("input image file name : ")
    wc = WordCloud(font_path="font/logotypejp_mp_b.ttf",
                   background_color="white", width="1000", height="1000")

    wc.generate(potato)
    wc.to_file(f"{file_name}.png")


make_cloud(words_counted)
